# 1.股票池的相关数据
# 2.股票池子的走势图整理！
# 3.用execl函数提取代码　　=MID(B2,LEN(B2)-4,4)
import re
import time
import urllib.request

from retrying import retry
from urllib.error import URLError
import os


def retry_if_io_error(exception):
    return isinstance(exception,URLError)

#  重复请求
@retry(retry_on_exception=retry_if_io_error)
def call_url(coding):
    l_path = os.getcwd()
    url = 'https://chart.yahoo.co.jp/?code=' + str(coding) + '.T&tm=1y&type=c&log=off&size=m&over=m65,m130,s&add=v&comp='
    urllib.request.urlretrieve(url, '{0}/{1}.jpg'.format(l_path,coding))




if __name__=='__main__':

# 2020.8.25
    pool_data =["1605","1820","1821","1928","2267","2282","2433","2702","2768","2801","2875","2914","3038","3254","3291","3626","3941","4061","4204","4307","4507","4527","4528","4543","4684","4732","4768","4902","5108","5214","5232","5334","5393","5631","6055","6146","6178","6235","6273","6326","6361","6367","6448","6472","6479","6504","6506","6594","6645","6674","6724","6727","6728","6758","6845","6857","6861","6869","6902","6920","6954","6965","6971","6976","6981","6988","7148","7259","7459","7550","7701","7731","7733","7735","7751","7846","7911","7912","7974","8001","8002","8031","8035","8053","8058","8113","8303","8309","8424","8473","8593","8697","8766","8804","8919","9062","9064","9086","9101","9104","9107","9375","9502","9503","9504","9506","9508","9509","9513","9531","9532","9719","9735","9810"]

    for coding in pool_data:
        call_url(coding)
        print(coding)
    print("图片下载完毕")
